## :white_check_mark: Apply Result (main)

[CI link](https://github.com/Shion1305/Shion1305-infra/actions/runs/12449639761)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
oci_identity_compartment.main-compartment: Refreshing state... [id=ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq]
oci_kms_vault.main: Refreshing state... [id=ocid1.vault.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrc6p3slv4lvmnljlxljomxbe7opkyleyv4jictsq7zedidplooc3q]
oci_core_vcn.main-vcn: Refreshing state... [id=ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra]
oci_core_internet_gateway.main-internet-gateway: Refreshing state... [id=ocid1.internetgateway.oc1.ap-tokyo-1.aaaaaaaaw3dtysi3sctisyiqic4jxduykrhke2eo6dafwrgoqqbpzgung6ma]
oci_core_dhcp_options.main-dhcp-options: Refreshing state... [id=ocid1.dhcpoptions.oc1.ap-tokyo-1.aaaaaaaavdzkksyupctnoqbj2hpo6w63vxtgx227o7hv52kl4nru6bcjvfwa]
oci_core_security_list.main-security-list: Refreshing state... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaa55cshiuxh35trjx2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa]
oci_core_route_table.main-route-table: Refreshing state... [id=ocid1.routetable.oc1.ap-tokyo-1.aaaaaaaa5pv27xf72rg4p54tenysrpi7rzsvmu7laetwnikkmzdbevhmz4la]
oci_kms_key.main: Refreshing state... [id=ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrcgbadgfcyyh37o477ahhoxox25bmfmqqf45en22ebms4taes42ha]
oci_core_subnet.main-subnet: Refreshing state... [id=ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq]
oci_core_instance.instance-2022: Refreshing state... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycklw5l5plncwm7nj64rdqpga6zfe67gsn2zzouexqnlwa]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # oci_kms_key.main must be replaced
-/+ resource "oci_kms_key" "main" {
      ~ current_key_version            = "ocid1.keyversion.oc1.ap-tokyo-1.eztwosspaafyo.cuiim5tvv6aaa.abxhiljr3z6z72iixeuamcxrrr4g33tvj4ngcdamlm25boob4jnos2oykgka" -> (known after apply)
      ~ defined_tags                   = {} -> (known after apply)
      ~ desired_state                  = "ENABLED" -> (known after apply)
      ~ display_name                   = "main_key" -> "main_key_aes"
      ~ external_key_reference_details = [] -> (known after apply)
      ~ freeform_tags                  = {} -> (known after apply)
      ~ id                             = "ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrcgbadgfcyyh37o477ahhoxox25bmfmqqf45en22ebms4taes42ha" -> (known after apply)
      ~ is_auto_rotation_enabled       = false -> (known after apply)
      ~ is_primary                     = true -> (known after apply)
      ~ replica_details                = [] -> (known after apply)
      + restored_from_key_id           = (known after apply)
      ~ state                          = "ENABLED" -> (known after apply)
      ~ time_created                   = "2024-12-22 00:19:04.976 +0000 UTC" -> (known after apply)
      + time_of_deletion               = (known after apply)
      ~ vault_id                       = "ocid1.vault.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrc6p3slv4lvmnljlxljomxbe7opkyleyv4jictsq7zedidplooc3q" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ auto_key_rotation_details {
          + compartment_id                 = (known after apply)
          + current_key_version            = (known after apply)
          + defined_tags                   = (known after apply)
          + desired_state                  = (known after apply)
          + display_name                   = (known after apply)
          + external_key_reference_details = (known after apply)
          + freeform_tags                  = (known after apply)
          + id                             = (known after apply)
          + is_auto_rotation_enabled       = (known after apply)
          + is_primary                     = (known after apply)
          + management_endpoint            = (known after apply)
          + protection_mode                = (known after apply)
          + replica_details                = (known after apply)
          + restore_trigger                = (known after apply)
          + restored_from_key_id           = (known after apply)
          + state                          = (known after apply)
          + time_created                   = (known after apply)
          + time_of_deletion               = (known after apply)
          + vault_id                       = (known after apply)
        } -> (known after apply)

      ~ external_key_reference {
          + compartment_id                 = (known after apply)
          + current_key_version            = (known after apply)
          + defined_tags                   = (known after apply)
          + desired_state                  = (known after apply)
          + display_name                   = (known after apply)
          + external_key_reference_details = (known after apply)
          + freeform_tags                  = (known after apply)
          + id                             = (known after apply)
          + is_auto_rotation_enabled       = (known after apply)
          + is_primary                     = (known after apply)
          + management_endpoint            = (known after apply)
          + protection_mode                = (known after apply)
          + replica_details                = (known after apply)
          + restore_trigger                = (known after apply)
          + restored_from_key_id           = (known after apply)
          + state                          = (known after apply)
          + time_created                   = (known after apply)
          + time_of_deletion               = (known after apply)
          + vault_id                       = (known after apply)
        } -> (known after apply)

      ~ key_shape {
          ~ algorithm = "RSA" -> "AES" # forces replacement
          + curve_id  = (known after apply)
          ~ length    = 512 -> 32 # forces replacement
        }
    }

  # module.oci_compute_instance-2024.oci_core_instance.this will be created
  + resource "oci_core_instance" "this" {
      + availability_domain                 = "kbTA:AP-TOKYO-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "oci_compute_instance-2024-1"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = "FAULT-DOMAIN-1"
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAAEAQDAR5lLWfcv3R351aosBQo/SDAN+VEXYrrxedgGBBJSwaYFKJ1/IX/+dXKUL+NPPL56MJtFSzLCBIsJj5dMzahGHvCtbo5JIpOPKGagHpAo4e7JvSFRUV1jMvW6TI6S09xch8cNNMK32tPVhptV9L9J63XZz3WnH9ApW7jZiBlboOzC2sYLBfcIMVW1a4Sp5CN0ACrjOv//xx4gNHX6QCYCF19xlAeosRSqGrI/av8pohOMCSF7XI6U60YaDsRLPNrzMEParcad7ZygVpMI1SmP39U+7aCbHZJF7rMpckJVKH7tjZsZXOjl0AGXQDURptHsPOg9tWDZpflzYZRDT9juYIZc86jtE38ySsBos4jPWkTuz8ltSkqyeDOyvjExj9dC4i0RT/rgLgKmOQwvQrTfJ4LdLFV846ThACW6c8CISazBorskju7xF1bAKTGfhm3duV90xiuPl+XZpaf3JXaafvqCGX9hJ4GnRx6Xcu930PwN5jEPWgx1y/gpWPFBJQkNKaVpt8d2Tdzgubl1g9zY0w5Sta4/XhyZKBwZpJsMl92bghvd+WGDu0+q/6od7SC9ZPFZEpZWuE42Voswhi0AB2v+BqY8vQ2fxZA1faN6VpZQddetPOVqqwvmcGiD4USlqBadJK6AE1pGbUcfQqnmY/clGW76ZXMzOHnPzTXfAO9S+q9PtRmBB7JvbkzORAjiYwcYy+2DEwfedue+gPhRCSp0kcANESJxTwG3NN2PrUQ31Ttc1Yce5GqukTmVTN+iLAeU8cfZD2YNa5Kh6dwRN2Ej96SX6SpHzS5P/kULoNxATSooUA2pOJseH2vLcPWZw3fu5NXPypJ9HOkm6owYUINgInh1li08O2bphQgwiHfqn3VINKjWYYde8FQXEm1PX1vzlHGbuukIA26Pjh+IVAm7PgLTUpCle09m2aFOvzcdPfYHCg5p//SFTjssrRqnXJEbfppBTKXh39JNquoXI+1Yavzk6rt4Lsq7va+WrAzNlAa5l5fAoyrcSHeZT1w2mK/KO8AaZvMTclgyVov4fsMgvnpO6eWGlJM8qjllHY268UslFurck9RFMlI1dbEabn5zfJkyHj+o297m5BxTmOlg/J2JBg5zwPAh2dIJklL7uHu5ENi/dXd8gHVS48VyP0TcWmhAHDJtwMlw6mPIZp7kgi69WgcAb1RYEWOY1OxclZgJxb9v/fDiLQvLXCjKlB/05oUEmy3ZoHU5ah8CoLr14UKyYWOFzJhQKz/whFinl5xvw8XCf3wsw8zKa6qj30Oc9UfQNDkQa/HaJZTric7Utvx1mgXzm8rNDDGC63WE/ZZoG/bP3fojwP6r4wmNb1D79cwNHybrmD8V3PjL shionichikawa@ShionnoMacBook-Pro.local"
        }
      + preserve_boot_volume                = true
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + are_all_plugins_disabled = false
          + is_management_disabled   = false
          + is_monitoring_disabled   = false

          + plugins_config (known after apply)
        }

      + availability_config {
          + is_live_migration_preferred = true
          + recovery_action             = "RESTORE_INSTANCE"
        }

      + create_vnic_details {
          + assign_ipv6ip             = (known after apply)
          + assign_private_dns_record = true
          + assign_public_ip          = "true"
          + defined_tags              = (known after apply)
          + display_name              = "oci_compute_instance-2024-1"
          + freeform_tags             = (known after apply)
          + hostname_label            = "instance-2024-1"
          + nsg_ids                   = (known after apply)
          + private_ip                = "10.0.0.20"
          + security_attributes       = (known after apply)
          + skip_source_dest_check    = true
          + subnet_id                 = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq"
          + vlan_id                   = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options (known after apply)

      + launch_options {
          + boot_volume_type                    = "PARAVIRTUALIZED"
          + firmware                            = "UEFI_64"
          + is_consistent_volume_naming_enabled = true
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = "PARAVIRTUALIZED"
          + remote_data_volume_type             = "PARAVIRTUALIZED"
        }

      + launch_volume_attachments (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 6
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
          + vcpus                         = 1
        }

      + source_details {
          + boot_volume_size_in_gbs         = "50"
          + boot_volume_vpus_per_gb         = "10"
          + is_preserve_boot_volume_enabled = false
          + source_id                       = "ocid1.image.oc1.ap-tokyo-1.aaaaaaaax3arbzsjtoqovmp56hfba3q2qyxljbci6ejkuagmkjql6ej3mj6q"
          + source_type                     = "image"

          + instance_source_image_filter_details (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
oci_kms_key.main: Destroying... [id=ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrcgbadgfcyyh37o477ahhoxox25bmfmqqf45en22ebms4taes42ha]
module.oci_compute_instance-2024.oci_core_instance.this: Creating...
oci_kms_key.main: Still destroying... [id=ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo....477ahhoxox25bmfmqqf45en22ebms4taes42ha, 10s elapsed]
module.oci_compute_instance-2024.oci_core_instance.this: Still creating... [10s elapsed]
oci_kms_key.main: Still destroying... [id=ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo....477ahhoxox25bmfmqqf45en22ebms4taes42ha, 20s elapsed]
module.oci_compute_instance-2024.oci_core_instance.this: Still creating... [20s elapsed]
oci_kms_key.main: Still destroying... [id=ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo....477ahhoxox25bmfmqqf45en22ebms4taes42ha, 30s elapsed]
module.oci_compute_instance-2024.oci_core_instance.this: Still creating... [30s elapsed]
oci_kms_key.main: Destruction complete after 37s
oci_kms_key.main: Creating...
module.oci_compute_instance-2024.oci_core_instance.this: Still creating... [40s elapsed]
oci_kms_key.main: Still creating... [10s elapsed]
module.oci_compute_instance-2024.oci_core_instance.this: Still creating... [50s elapsed]
module.oci_compute_instance-2024.oci_core_instance.this: Creation complete after 51s [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcychwfisyzuceagjszyhr2bv2qlglc2xyqrpno6xtpwbm7q]
oci_kms_key.main: Still creating... [20s elapsed]
oci_kms_key.main: Still creating... [30s elapsed]
oci_kms_key.main: Still creating... [40s elapsed]
oci_kms_key.main: Still creating... [50s elapsed]
oci_kms_key.main: Still creating... [1m0s elapsed]
oci_kms_key.main: Still creating... [1m10s elapsed]
oci_kms_key.main: Still creating... [1m20s elapsed]
oci_kms_key.main: Still creating... [1m30s elapsed]
oci_kms_key.main: Still creating... [1m40s elapsed]
oci_kms_key.main: Still creating... [1m50s elapsed]
oci_kms_key.main: Still creating... [2m0s elapsed]
oci_kms_key.main: Still creating... [2m10s elapsed]
oci_kms_key.main: Still creating... [2m20s elapsed]
oci_kms_key.main: Creation complete after 2m29s [id=ocid1.key.oc1.ap-tokyo-1.eztwosspaafyo.abxhiljrzskbcgfpswirx3i7sokmf2shh4iadjbgnausysbvrdi7zyjprymq]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>



<!-- github-comment: {"Command":"apply","JobName":"run-terragrunt-apply","PRNumber":34,"Program":"tfcmt","SHA1":"8b7297ab98548ec07708d8447cd73513b207b182","Target":"main","Vars":{},"WorkflowName":"Run Apply on OCI"} -->